IDEA StatiCa Open Model
CoordSystemByZup Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Coordinates system based on local Z axis up In case local X is vertical then Y local axis follows Y global axis.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry3D.CoordSystem
 IdeaRS.OpenModel.Geometry3D.CoordSystemByZup
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class CoordSystemByZup : CoordSystem
Public Class CoordSystemByZup
	Inherits CoordSystem
public ref class CoordSystemByZup : public CoordSystem
The CoordSystemByZup type exposes the following members.
Constructors
Name | Description
CoordSystemByZup
Initializes a new instance of the CoordSystemByZup class
Top
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace